#include "WorkWithOLED.h"
#include "WorkWithOLED_pics.h"

//21 символ по горизонтали начиная с 1
uint16_t gg = 0;  // для счетчика в while
uint8_t temp[2] = { 0, 0 };
uint8_t temp_char[7] = { 0, 0, 0, 0, 0, 0, 0 }; // для вывода буковок
unsigned char LCD_X, LCD_Y;
//struct Pik Piki[];


//struct Pik Piki[] = { { 1, 2, 3, 4, { 1, 4 } } };
//struct Pik Piki[] = { { 1, 2, 3, 4 }, {5,6,7,8}};
//struct Pik pppp = { 1, 2, 3, 4, {1,4,255,8,9,44,55} };
//struct HUI hhh = { 1, 2, 3, 4 };




	


void LCD_Clear(void)
{
	//int fffff = pppp.Pipik[2];
	
	//uint8_t ljsfj = pppp.Pipik[1][1];
	//uint8_t ljljkjkjl=
	
	//uint8_t rr=
	
	
	//rrr.
	unsigned short i;
	unsigned short x = 0;
	unsigned short y = 0;
	LCD_GoTo(0, 0);
 
	for (i = 0; i < (OLED_BUFFERSIZE); i++) //(SSD1306_LCDWIDTH*SSD1306_LCDHEIGHT/8)
		{
			LCD_Char2(' ');
			x++;
			if (x > OLED_WIDTH)
			{
				x = 0;
				y++;
				LCD_GoTo(0, y);
			}
		}
	LCD_X = OLED_DEFAULT_SPACE;
	LCD_Y = 0;
}











const char sym[][5] =
{
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 0
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 1
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 2
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 3
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 4
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 5
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 6
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 7
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 8
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 9
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 10
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 11
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 12
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 13
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 14
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 15
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 16
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 17
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 18
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 19
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 20
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 21
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 22
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 23
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 24
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 25
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 26
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 27
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 28
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 29
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 30
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 31
{0x00, 0x00, 0x00, 0x00, 0x00},      //пробел _ 32
{0x00, 0x00, 0x4f, 0x00, 0x00},      //! _ 33
{0x00, 0x07, 0x00, 0x07, 0x00},      //" _ 34
{0x14, 0x7f, 0x14, 0x7f, 0x14},      //# _ 35
{0x24, 0x2a, 0x7f, 0x2a, 0x12},      //$  _ 36
{0x23, 0x13, 0x08, 0x64, 0x62},      //%  _ 37
{0x36, 0x49, 0x55, 0x22, 0x40},      //& _ 38
{0x00, 0x01, 0x02, 0x04, 0x00},      //' _ 39
{0x00, 0x1c, 0x22, 0x41, 0x00},      //( _ 40
{0x00, 0x41, 0x22, 0x1c, 0x00},      //) _ 41
{0x14, 0x08, 0x3E, 0x08, 0x14},      //* _ 42
{0x08, 0x08, 0x3E, 0x08, 0x08},      //+ _ 43
{0x00, 0x05, 0x03, 0x00, 0x00},      //, _ 44
{0x08, 0x08, 0x08, 0x08, 0x08},      //- _ 45
{0x00, 0x60, 0x60, 0x00, 0x00},      //. _ 46
{0x20, 0x10, 0x08, 0x04, 0x02},      /// _ 47
{0x3e, 0x51, 0x49, 0x45, 0x3e},      //0 _ 48
{0x00, 0x42, 0x7f, 0x40, 0x00},      //1 _ 49
{0x42, 0x61, 0x51, 0x49, 0x46},      //2 _ 50
{0x21, 0x41, 0x45, 0x4b, 0x31},      //3 _ 51
{0x18, 0x14, 0x12, 0x7f, 0x10},      //4 _ 52
{0x27, 0x45, 0x45, 0x45, 0x39},      //5 _ 53
{0x3c, 0x4a, 0x49, 0x49, 0x30},      //6 _ 54
{0x01, 0x71, 0x09, 0x05, 0x03},      //7 _ 55
{0x36, 0x49, 0x49, 0x49, 0x36},      //8 _ 56
{0x06, 0x49, 0x49, 0x29, 0x1e},      //9 _ 57
{0x00, 0x36, 0x36, 0x00, 0x00},      //: _ 58
{0x00, 0x56, 0x36, 0x00, 0x00},      //; _ 59
{0x08, 0x14, 0x22, 0x41, 0x00},      //< _ 60
{0x14, 0x14, 0x14, 0x14, 0x14},      //= _ 61
{0x00, 0x41, 0x22, 0x14, 0x08},      //> _ 62
{0x02, 0x01, 0x51, 0x09, 0x06},      //? _ 63
{0x32, 0x49, 0x71, 0x41, 0x3e},      //@  _ 64
{0x7e, 0x11, 0x11, 0x11, 0x7e},      //A _ 65
{0x7f, 0x49, 0x49, 0x49, 0x36},      //B _ 66
{0x3e, 0x41, 0x41, 0x41, 0x22},      //C _ 67
{0x7f, 0x41, 0x41, 0x22, 0x1c},      //D _ 68
{0x7f, 0x49, 0x49, 0x49, 0x41},      //E _ 69
{0x7f, 0x09, 0x09, 0x09, 0x01},      //F _ 70
{0x3e, 0x41, 0x49, 0x49, 0x3a},      //G _ 71
{0x7f, 0x08, 0x08, 0x08, 0x7f},      //H _ 72
{0x00, 0x41, 0x7f, 0x41, 0x00},      //I _ 73
{0x20, 0x40, 0x41, 0x3f, 0x01},      //J _ 74
{0x7f, 0x08, 0x14, 0x22, 0x41},      //K _ 75
{0x7f, 0x40, 0x40, 0x40, 0x40},      //L _ 76
{0x7f, 0x02, 0x0c, 0x02, 0x7f},      //M _ 77
{0x7f, 0x04, 0x08, 0x10, 0x7f},      //N _ 78
{0x3e, 0x41, 0x41, 0x41, 0x3e},      //O  _ 79
{0x7f, 0x09, 0x09, 0x09, 0x06},      //P _ 80
{0x3e, 0x41, 0x51, 0x21, 0x5e},      //Q _ 81
{0x7f, 0x09, 0x19, 0x29, 0x46},      //R _ 82
{0x46, 0x49, 0x49, 0x49, 0x31},      //S _ 83
{0x01, 0x01, 0x7f, 0x01, 0x01},      //T _ 84
{0x3f, 0x40, 0x40, 0x40, 0x3f},      //U _ 85
{0x1f, 0x20, 0x40, 0x20, 0x1f},      //V _ 86
{0x3f, 0x40, 0x70, 0x40, 0x3f},      //W _ 87
{0x63, 0x14, 0x08, 0x14, 0x63},      //X _ 88
{0x07, 0x08, 0x70, 0x08, 0x07},      //Y _ 89
{0x61, 0x51, 0x49, 0x45, 0x43},      //Z _ 90
{0x00, 0x7F, 0x41, 0x41, 0x00},      //[ _ 91
{0x02, 0x04, 0x08, 0x10, 0x20},      //\  _ 92
{0x00, 0x41, 0x41, 0x7F, 0x00},      //] _ 93
{0x04, 0x02, 0x01, 0x02, 0x04},      //^ _ 94
{0x40, 0x40, 0x40, 0x40, 0x40},      //_ _ 95
{0x00, 0x00, 0x00, 0x00, 0x00},      //резерв  _ 96
{0x20, 0x54, 0x54, 0x54, 0x78},      //a  _ 97
{0x7F, 0x48, 0x44, 0x44, 0x38},      //b _ 98
{0x38, 0x44, 0x44, 0x44, 0x20},      //c _ 99
{0x38, 0x44, 0x44, 0x48, 0x7F},      //d _ 100
{0x38, 0x54, 0x54, 0x54, 0x18},      //e _ 101
{0x08, 0x7E, 0x09, 0x01, 0x02},      //f _ 102
{0x0C, 0x52, 0x52, 0x52, 0x3E},      //g _ 103
{0x7F, 0x08, 0x04, 0x04, 0x78},      //h _ 104
{0x00, 0x44, 0x7D, 0x40, 0x00},      //i _ 105
{0x20, 0x40, 0x44, 0x3D, 0x00},      //j _ 106
{0x7F, 0x10, 0x28, 0x44, 0x00},      //k _ 107
{0x00, 0x41, 0x7F, 0x40, 0x00},      //l _ 108
{0x7C, 0x04, 0x18, 0x04, 0x78},      //m _ 109
{0x7C, 0x08, 0x04, 0x04, 0x78},      //n _ 110
{0x38, 0x44, 0x44, 0x44, 0x38},      //o _ 111
{0x7C, 0x14, 0x14, 0x14, 0x08},      //p  _ 112
{0x08, 0x14, 0x14, 0x18, 0x7C},      //q _ 113
{0x7C, 0x08, 0x04, 0x04, 0x08},      //r _ 114
{0x48, 0x54, 0x54, 0x54, 0x20},      //s _ 115
{0x04, 0x3F, 0x44, 0x40, 0x20},      //t _ 116
{0x3C, 0x40, 0x40, 0x20, 0x7C},      //u _ 117
{0x1C, 0x20, 0x40, 0x20, 0x1C},      //v _ 118
{0x3C, 0x40, 0x30, 0x40, 0x3C},      //w _ 119
{0x44, 0x28, 0x10, 0x28, 0x44},      //x _ 120
{0x0C, 0x50, 0x50, 0x50, 0x3C},      //y _ 121
{0x44, 0x64, 0x54, 0x4C, 0x44},      //z  _ 122
{0x00, 0x08, 0x36, 0x41, 0x00},      //{ _ 123
{0x00, 0x00, 0x7f, 0x00, 0x00},      //| _ 124
{0x00, 0x41, 0x36, 0x08, 0x00},      //} _ 125
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 126
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 127
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 128
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 129
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 130
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 131
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 132
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 133
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 134
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 135
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 136
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 137
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 138
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 139
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 140
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 141
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 142
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 143
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 144
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 145
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 146
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 147
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 148
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 149
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 150
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 151
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 152
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 153
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 154
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 155
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 156
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 157
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 158
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 159
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 160
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 161
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 162
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 163
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 164
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 165
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 166
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 167
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 168
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 169
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 170
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 171
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 172
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 173
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 174
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 175
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 176
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 177
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 178
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 179
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 180
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 181
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 182
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 183
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 184
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 185
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 186
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 187
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 188
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 189
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 190
{0x02, 0x01, 0x02, 0x02, 0x01},      //~ _ 191
{0x7e, 0x11, 0x11, 0x11, 0x7e},      //A  _ 192
{0x7f, 0x49, 0x49, 0x49, 0x33},      //Б _ 193
{0x7f, 0x49, 0x49, 0x49, 0x36},      //В _ 194
{0x7f, 0x01, 0x01, 0x01, 0x03},      //Г _ 195
{0xe0, 0x51, 0x4f, 0x41, 0xff},      //Д  _ 196
{0x7f, 0x49, 0x49, 0x49, 0x41},      //E _ 197
{0x77, 0x08, 0x7f, 0x08, 0x77},      //Ж _ 198
{0x41, 0x49, 0x49, 0x49, 0x36},      //З _ 199
{0x7f, 0x10, 0x08, 0x04, 0x7f},      //И _ 200
{0x7c, 0x21, 0x12, 0x09, 0x7c},      //Й _ 201
{0x7f, 0x08, 0x14, 0x22, 0x41},      //K _ 202
{0x20, 0x41, 0x3f, 0x01, 0x7f},      //Л _ 203
{0x7f, 0x02, 0x0c, 0x02, 0x7f},      //M _ 204
{0x7f, 0x08, 0x08, 0x08, 0x7f},      //H _ 205
{0x3e, 0x41, 0x41, 0x41, 0x3e},      //O  _ 206
{0x7f, 0x01, 0x01, 0x01, 0x7f},      //П _ 207
{0x7f, 0x09, 0x09, 0x09, 0x06},      //P _ 208
{0x3e, 0x41, 0x41, 0x41, 0x22},      //C _ 209
{0x01, 0x01, 0x7f, 0x01, 0x01},      //T _ 210
{0x47, 0x28, 0x10, 0x08, 0x07},      //У _ 211
{0x1c, 0x22, 0x7f, 0x22, 0x1c},      //Ф _ 212
{0x63, 0x14, 0x08, 0x14, 0x63},      //X _ 213
{0x7f, 0x40, 0x40, 0x40, 0xff},      //Ц _ 214
{0x07, 0x08, 0x08, 0x08, 0x7f},      //Ч _ 215
{0x7f, 0x40, 0x7f, 0x40, 0x7f},      //Ш  _ 216
{0x7f, 0x40, 0x7f, 0x40, 0xff},      //Щ _ 217
{0x01, 0x7f, 0x48, 0x48, 0x30},      //Ъ _ 218
{0x7f, 0x48, 0x30, 0x00, 0x7f},      //Ы _ 219
{0x00, 0x7f, 0x48, 0x48, 0x30},      //Э _ 220
{0x22, 0x41, 0x49, 0x49, 0x3e},      //Ь _ 221
{0x7f, 0x08, 0x3e, 0x41, 0x3e},      //Ю _ 222
{0x46, 0x29, 0x19, 0x09, 0x7f},      //Я _ 223
{0x20, 0x54, 0x54, 0x54, 0x78},      //a _ 224
{0x3c, 0x4a, 0x4a, 0x49, 0x31},      //б _ 225
{0x7c, 0x54, 0x54, 0x28, 0x00},      //в  _ 226
{0x7c, 0x04, 0x04, 0x04, 0x0c},      //г _ 227
{0xe0, 0x54, 0x4c, 0x44, 0xfc},      //д _ 228
{0x38, 0x54, 0x54, 0x54, 0x18},      //e _ 229
{0x6c, 0x10, 0x7c, 0x10, 0x6c},      //ж _ 230
{0x44, 0x44, 0x54, 0x54, 0x28},      //з _ 231
{0x7c, 0x20, 0x10, 0x08, 0x7c},      //и _ 232
{0x7c, 0x41, 0x22, 0x11, 0x7c},      //й _ 233
{0x7c, 0x10, 0x28, 0x44, 0x00},      //к _ 234
{0x20, 0x44, 0x3c, 0x04, 0x7c},      //л _ 235
{0x7c, 0x08, 0x10, 0x08, 0x7c},      //м  _ 236
{0x7c, 0x10, 0x10, 0x10, 0x7c},      //н _ 237
{0x38, 0x44, 0x44, 0x44, 0x38},      //o _ 238
{0x7c, 0x04, 0x04, 0x04, 0x7c},      //п _ 239
{0x7C, 0x14, 0x14, 0x14, 0x08},      //p  _ 240
{0x38, 0x44, 0x44, 0x44, 0x20},      //c _ 241
{0x04, 0x04, 0x7c, 0x04, 0x04},      //т _ 242
{0x0C, 0x50, 0x50, 0x50, 0x3C},      //у _ 243
{0x30, 0x48, 0xfc, 0x48, 0x30},      //ф _ 244
{0x44, 0x28, 0x10, 0x28, 0x44},      //x _ 245
{0x7c, 0x40, 0x40, 0x40, 0xfc},      //ц  _ 246
{0x0c, 0x10, 0x10, 0x10, 0x7c},      //ч _ 247
{0x7c, 0x40, 0x7c, 0x40, 0x7c},      //ш _ 248
{0x7c, 0x40, 0x7c, 0x40, 0xfc},      //щ _ 249
{0x04, 0x7c, 0x50, 0x50, 0x20},      //ъ _ 250
{0x7c, 0x50, 0x50, 0x20, 0x7c},      //ы _ 251
{0x7c, 0x50, 0x50, 0x20, 0x00},      //ь _ 252
{0x28, 0x44, 0x54, 0x54, 0x38},      //э _ 253
{0x7c, 0x10, 0x38, 0x44, 0x38},      //ю _ 254
{0x08, 0x54, 0x34, 0x14, 0x7c},      //я  _ 255

/*	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 }, 	                    //# _ 0
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 }, 	                    //# _ 1
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 }, 	                    //# _ 2
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 3
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 4
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 5
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 6
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 7
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 8
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 9
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 10
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 11
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 12
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 13
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 14
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 15
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 16
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 17
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 18
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 19
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 20
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 21
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                     //# _ 22
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 23
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 24
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 25
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 26
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 27
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 28
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 29
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 30
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 31
	{ 0x00, 0x00, 0x00, 0x00, 0x00 },                     //пробел _ 32
	{ 0x00, 0x00, 0x4f, 0x00, 0x00 },	                    //! _ 33
	{ 0x00, 0x07, 0x00, 0x07, 0x00 },                     //" _ 34
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },                     //# _ 35
	{ 0x24, 0x2a, 0x7f, 0x2a, 0x12 },                     //$  _ 36
	{ 0x23, 0x13, 0x08, 0x64, 0x62 },                     //%  _ 37
	{ 0x36, 0x49, 0x55, 0x22, 0x40 },                     //& _ 38
	{ 0x00, 0x01, 0x02, 0x04, 0x00 },	                    //' _ 39
	{ 0x00, 0x1c, 0x22, 0x41, 0x00 },                     //( _ 40
	{ 0x00, 0x41, 0x22, 0x1c, 0x00 },	                    //) _ 41
	{ 0x14, 0x08, 0x3E, 0x08, 0x14 },                     // * _ 42
	{ 0x08, 0x08, 0x3E, 0x08, 0x08 },	                    //+ _ 43
	{ 0x00, 0x05, 0x03, 0x00, 0x00 },                     //, _ 44
	{ 0x08, 0x08, 0x08, 0x08, 0x08 },                     //- _ 45
	{ 0x00, 0x60, 0x60, 0x00, 0x00 },	                    //. _ 46
	{ 0x20, 0x10, 0x08, 0x04, 0x02 },	                    /// _ 47
	{ 0x3e, 0x51, 0x49, 0x45, 0x3e },                     //0 _ 48
	{ 0x00, 0x42, 0x7f, 0x40, 0x00 },                     //1 _ 49
	{ 0x42, 0x61, 0x51, 0x49, 0x46 },	                    //2 _ 50
	{ 0x21, 0x41, 0x45, 0x4b, 0x31 },	                    //3 _ 51
	{ 0x18, 0x14, 0x12, 0x7f, 0x10 },                     //4 _ 52
	{ 0x27, 0x45, 0x45, 0x45, 0x39 },	                    //5 _ 53
	{ 0x3c, 0x4a, 0x49, 0x49, 0x30 },                     //6 _ 54
	{ 0x01, 0x71, 0x09, 0x05, 0x03 },                     //7 _ 55
	{ 0x36, 0x49, 0x49, 0x49, 0x36 },	                    //8 _ 56
	{ 0x06, 0x49, 0x49, 0x29, 0x1e },	                    //9 _ 57
	{ 0x00, 0x36, 0x36, 0x00, 0x00 },                     //: _ 58
	{ 0x00, 0x56, 0x36, 0x00, 0x00 },	                    //; _ 59
	{ 0x08, 0x14, 0x22, 0x41, 0x00 },	                    //< _ 60
	{ 0x14, 0x14, 0x14, 0x14, 0x14 },                     //= _ 61
	{ 0x00, 0x41, 0x22, 0x14, 0x08 },                     //> _ 62
	{ 0x02, 0x01, 0x51, 0x09, 0x06 },	                    //? _ 63
	{ 0x32, 0x49, 0x71, 0x41, 0x3e },                     //@  _ 64
	{ 0x7e, 0x11, 0x11, 0x11, 0x7e },	                    //A _ 65
	{ 0x7f, 0x49, 0x49, 0x49, 0x36 },	                    //B _ 66
	{ 0x3e, 0x41, 0x41, 0x41, 0x22 },                     //C _ 67
	{ 0x7f, 0x41, 0x41, 0x22, 0x1c },                     //D _ 68
	{ 0x7f, 0x49, 0x49, 0x49, 0x41 },                     //E _ 69
	{ 0x7f, 0x09, 0x09, 0x09, 0x01 },	                    //F _ 70
	{ 0x3e, 0x41, 0x49, 0x49, 0x3a },	                    //G _ 71
	{ 0x7f, 0x08, 0x08, 0x08, 0x7f },                     //H _ 72
	{ 0x00, 0x41, 0x7f, 0x41, 0x00 },                     //I _ 73
	{ 0x20, 0x40, 0x41, 0x3f, 0x01 },	                    //J _ 74
	{ 0x7f, 0x08, 0x14, 0x22, 0x41 },	                    //K _ 75
	{ 0x7f, 0x40, 0x40, 0x40, 0x40 },	                    //L _ 76
	{ 0x7f, 0x02, 0x0c, 0x02, 0x7f },                     //M _ 77
	{ 0x7f, 0x04, 0x08, 0x10, 0x7f },                     //N _ 78
	{ 0x3e, 0x41, 0x41, 0x41, 0x3e },                     //O  _ 79
	{ 0x7f, 0x09, 0x09, 0x09, 0x06 },                     //P _ 80
	{ 0x3e, 0x41, 0x51, 0x21, 0x5e },	                    //Q _ 81
	{ 0x7f, 0x09, 0x19, 0x29, 0x46 },                     //R _ 82
	{ 0x46, 0x49, 0x49, 0x49, 0x31 },                     //S _ 83
	{ 0x01, 0x01, 0x7f, 0x01, 0x01 },                     //T _ 84
	{ 0x3f, 0x40, 0x40, 0x40, 0x3f },                     //U _ 85
	{ 0x1f, 0x20, 0x40, 0x20, 0x1f },	                     //V _ 86
	{ 0x3f, 0x40, 0x70, 0x40, 0x3f },	                    //W _ 87
	{ 0x63, 0x14, 0x08, 0x14, 0x63 },                     //X _ 88
	{ 0x07, 0x08, 0x70, 0x08, 0x07 },	                    //Y _ 89
	{ 0x61, 0x51, 0x49, 0x45, 0x43 },	                     //Z _ 90
	{ 0x00, 0x7F, 0x41, 0x41, 0x00 },	                     //[ _ 91
	{ 0x02, 0x04, 0x08, 0x10, 0x20 },	                     //\  _ 92
	{ 0x00, 0x41, 0x41, 0x7F, 0x00 },	                    //] _ 93
	{ 0x04, 0x02, 0x01, 0x02, 0x04 },	                     //^ _ 94
	{ 0x40, 0x40, 0x40, 0x40, 0x40 },	                     //_ _ 95
	{ 0x00, 0x00, 0x00, 0x00, 0x00 },	                     //резерв 95 _ 96
	{ 0x20, 0x54, 0x54, 0x54, 0x78 },	                     //a  _ 97
	{ 0x7F, 0x48, 0x44, 0x44, 0x38 },	                     //b _ 98
	{ 0x38, 0x44, 0x44, 0x44, 0x20 },	                     //c _ 99
	{ 0x38, 0x44, 0x44, 0x48, 0x7F },	                    //d _ 100
	{ 0x38, 0x54, 0x54, 0x54, 0x18 },	                    //e _ 101
	{ 0x08, 0x7E, 0x09, 0x01, 0x02 },	                    //f _ 102
	{ 0x0C, 0x52, 0x52, 0x52, 0x3E },	                    //g _ 103
	{ 0x7F, 0x08, 0x04, 0x04, 0x78 },                     //h _ 104
	{ 0x00, 0x44, 0x7D, 0x40, 0x00 },                     //i _ 105
	{ 0x20, 0x40, 0x44, 0x3D, 0x00 },	                    //j _ 106
	{ 0x7F, 0x10, 0x28, 0x44, 0x00 },	                     //k _ 107
	{ 0x00, 0x41, 0x7F, 0x40, 0x00 },	                     //l _ 108
	{ 0x7C, 0x04, 0x18, 0x04, 0x78 },	                     //m _ 109
	{ 0x7C, 0x08, 0x04, 0x04, 0x78 },	                     //n _ 110
	{ 0x38, 0x44, 0x44, 0x44, 0x38 },	                    //o _ 111
	{ 0x7C, 0x14, 0x14, 0x14, 0x08 },	                     //p  _ 112
	{ 0x08, 0x14, 0x14, 0x18, 0x7C },	                    //q _ 113
	{ 0x7C, 0x08, 0x04, 0x04, 0x08 },	                     //r _ 114
	{ 0x48, 0x54, 0x54, 0x54, 0x20 },	                     //s _ 115
	{ 0x04, 0x3F, 0x44, 0x40, 0x20 },	                     //t _ 116
	{ 0x3C, 0x40, 0x40, 0x20, 0x7C },	                    //u _ 117
	{ 0x1C, 0x20, 0x40, 0x20, 0x1C },	                     //v _ 118
	{ 0x3C, 0x40, 0x30, 0x40, 0x3C },	                    //w _ 119
	{ 0x44, 0x28, 0x10, 0x28, 0x44 },	                     //x _ 120
	{ 0x0C, 0x50, 0x50, 0x50, 0x3C },	                    //y _ 121
	{ 0x44, 0x64, 0x54, 0x4C, 0x44 },	                    //z  _ 122
	{ 0x00, 0x08, 0x36, 0x41, 0x00 },	                    //{ _ 123
	{ 0x00, 0x00, 0x7f, 0x00, 0x00 },	                    //| _ 124
	{ 0x00, 0x41, 0x36, 0x08, 0x00 },	                     //} _ 125
	{ 0x02, 0x01, 0x02, 0x02, 0x01 },	                     //~ _ 126
	{ 0x14, 0x7f, 0x14, 0x7f, 0x14 },	                    //# _ 127
	{ 0x7C, 0x14, 0x14, 0x14, 0x08 },	                    //p  _ 128
	{ 0x38, 0x44, 0x44, 0x44, 0x20 },                     //c _ 129
	{ 0x04, 0x04, 0x7c, 0x04, 0x04 },                     //т _ 130
	{ 0x0C, 0x50, 0x50, 0x50, 0x3C },	                    //у _ 131
	{ 0x30, 0x48, 0xfc, 0x48, 0x30 },	                    //ф _ 132
	{ 0x44, 0x28, 0x10, 0x28, 0x44 },	                    //x _ 133
	{ 0x7c, 0x40, 0x40, 0x40, 0xfc },                     //ц  _ 134
	{ 0x0c, 0x10, 0x10, 0x10, 0x7c },                     //ч _ 135
	{ 0x7c, 0x40, 0x7c, 0x40, 0x7c },                     //ш _ 136
	{ 0x7c, 0x40, 0x7c, 0x40, 0xfc },	                    //щ _ 137
	{ 0x04, 0x7c, 0x50, 0x50, 0x20 },                     //ъ _ 138
	{ 0x7c, 0x50, 0x50, 0x20, 0x7c },                     //ы _ 139
	{ 0x7c, 0x50, 0x50, 0x20, 0x00 },                     //ь _ 140
	{ 0x28, 0x44, 0x54, 0x54, 0x38 },	                    //э _ 141
	{ 0x7c, 0x10, 0x38, 0x44, 0x38 },                     //ю _ 142
	{ 0x08, 0x54, 0x34, 0x14, 0x7c },	                    //я  _ 143
	{ 0x7e, 0x11, 0x11, 0x11, 0x7e },	                    //A  _ 144
	{ 0x7f, 0x49, 0x49, 0x49, 0x33 },                     //Б _ 145
	{ 0x7f, 0x49, 0x49, 0x49, 0x36 },                     //В _ 146
	{ 0x7f, 0x01, 0x01, 0x01, 0x03 },	                    //Г _ 147
	{ 0xe0, 0x51, 0x4f, 0x41, 0xff },                     //Д  _ 148
	{ 0x7f, 0x49, 0x49, 0x49, 0x41 },	                    //E _ 149
	{ 0x77, 0x08, 0x7f, 0x08, 0x77 },	                    //Ж _ 150
	{ 0x41, 0x49, 0x49, 0x49, 0x36 },	                    //З _ 151
	{ 0x7f, 0x10, 0x08, 0x04, 0x7f },                     //И _ 152
	{ 0x7c, 0x21, 0x12, 0x09, 0x7c },	                    //Й _ 153
	{ 0x7f, 0x08, 0x14, 0x22, 0x41 },                     //K _ 154
	{ 0x20, 0x41, 0x3f, 0x01, 0x7f },	                    //Л _ 155
	{ 0x7f, 0x02, 0x0c, 0x02, 0x7f },                     //M _ 156
	{ 0x7f, 0x08, 0x08, 0x08, 0x7f },	                    //H _ 157
	{ 0x3e, 0x41, 0x41, 0x41, 0x3e },                     //O  _ 158
	{ 0x7f, 0x01, 0x01, 0x01, 0x7f },                     //П _ 159
	{ 0x7f, 0x09, 0x09, 0x09, 0x06 },                     //P _ 160
	{ 0x3e, 0x41, 0x41, 0x41, 0x22 },	                    //C _ 161
	{ 0x01, 0x01, 0x7f, 0x01, 0x01 },                     //T _ 162
	{ 0x47, 0x28, 0x10, 0x08, 0x07 },                     //У _ 163
	{ 0x1c, 0x22, 0x7f, 0x22, 0x1c },                     //Ф _ 164
	{ 0x63, 0x14, 0x08, 0x14, 0x63 },                     //X _ 165
	{ 0x7f, 0x40, 0x40, 0x40, 0xff },                     //Ц _ 166
	{ 0x07, 0x08, 0x08, 0x08, 0x7f },                     //Ч _ 167
	{ 0x7f, 0x40, 0x7f, 0x40, 0x7f },                     //Ш  _ 168
	{ 0x7f, 0x40, 0x7f, 0x40, 0xff },                     //Щ _ 169
	{ 0x01, 0x7f, 0x48, 0x48, 0x30 },                     //Ъ _ 170
	{ 0x7f, 0x48, 0x30, 0x00, 0x7f },                    //Ы _ 171
	{ 0x00, 0x7f, 0x48, 0x48, 0x30 },                     //Э _ 172
	{ 0x22, 0x41, 0x49, 0x49, 0x3e },	                    //Ь _ 173
	{ 0x7f, 0x08, 0x3e, 0x41, 0x3e },                     //Ю _ 174
	{ 0x46, 0x29, 0x19, 0x09, 0x7f },	                    //Я _ 175
	{ 0x20, 0x54, 0x54, 0x54, 0x78 },	                    //a _ 176
	{ 0x3c, 0x4a, 0x4a, 0x49, 0x31 },                     //б _ 177
	{ 0x7c, 0x54, 0x54, 0x28, 0x00 },	                    //в  _ 178
	{ 0x7c, 0x04, 0x04, 0x04, 0x0c },                     //г _ 179
	{ 0xe0, 0x54, 0x4c, 0x44, 0xfc },                     //д _ 180
	{ 0x38, 0x54, 0x54, 0x54, 0x18 },                     //e _ 181
	{ 0x6c, 0x10, 0x7c, 0x10, 0x6c },                     //ж _ 182
	{ 0x44, 0x44, 0x54, 0x54, 0x28 },	                    //з _ 183
	{ 0x7c, 0x20, 0x10, 0x08, 0x7c },                     //и _ 184
	{ 0x7c, 0x41, 0x22, 0x11, 0x7c },	                    //й _ 185
	{ 0x7c, 0x10, 0x28, 0x44, 0x00 },	                    //к _ 186
	{ 0x20, 0x44, 0x3c, 0x04, 0x7c },                     //л _ 187
	{ 0x7c, 0x08, 0x10, 0x08, 0x7c },                     //м  _ 188
	{ 0x7c, 0x10, 0x10, 0x10, 0x7c },	                    //н _ 189
	{ 0x38, 0x44, 0x44, 0x44, 0x38 },	                    //o _ 190
	{ 0x7c, 0x04, 0x04, 0x04, 0x7c },                     //п _ 191 */

};



void sendCommand(uint8_t command_s)
{
	temp[0] = COMAND;
	temp[1] = command_s;
	HAL_I2C_Master_Transmit(&hi2c1, OLED_adress, temp, 2, 100);
}

void sendData(uint8_t data_s)
{
	temp[0] = DATA;
	temp[1] = data_s;
	HAL_I2C_Master_Transmit(&hi2c1, OLED_adress, temp, 2, 100);
}

void LCD_GoTo(unsigned char x, unsigned char y)
{
	x+=2;
	LCD_X = x;
	LCD_Y = y;
	sendCommand(0xB0 + y);
	sendCommand(x & 0xf);
	sendCommand(0x10 | (x >> 4));
}


void LCD_Char2(unsigned int c)
{
	unsigned char x = 0;
	temp_char[0] = 0x40;
	for (x = 0; x < 5; x++)
	{
		temp_char[x + 1] = sym[c][x];
	}
	temp_char[6] = 0;
	HAL_I2C_Master_Transmit(&hi2c1, OLED_adress, temp_char, 7, 1000);

//	LCD_X += 8;
//	if (LCD_X > OLED_WIDTH)
//	{
//		LCD_X = OLED_DEFAULT_SPACE;
//		LCD_Y += 1;
//	}
}

void HexToChar(unsigned int H)
{
	
	 
	//HexToBitIn32_Char = "0000000000";
	uint8_t i = 0;
	for (i = 0; i < 32; i++)HexToBitIn32_Char[i] = 0;
	i = 0;
	do
	{
		HexToBitIn32_Char[i++] =  (H % 2);
		H = H / 2;
	} while (H > 0);
	i = 33;
}

void LCD_PrintReg(unsigned int RegHex, char* RegName)
{
	//LCD_Clear();
	HexToChar(RegHex);
	LCD_GoTo(6, 0);
	LCD_String("3322 2222 2222 1111");
	LCD_GoTo(6, 1);
	LCD_String("1098 7654 3210 9876");
	LCD_GoTo(6, 2);
	LCD_String(":::: :::: :::: ::::");
	LCD_GoTo(6, 3);
	int8_t i=0;
	int8_t si = 0;
	char *s;
	for (i = 31; i > 15; i--)
	{
		if (i == 27 || i == 23 || i == 19)LCD_Char2(32);
		s = HexToBitIn32_Char[i];
		si = *s;
		LCD_Char2(HexToBitIn32_Char[i]+48);
		//LCD_Char2(s);
	}
	LCD_GoTo(6, 4);
	for (i = 15; i >= 0; i--)
	{
		if (i == 11 || i == 7 || i == 3)LCD_Char2(32);
		s = HexToBitIn32_Char[i];
		si = *s;
		LCD_Char2(HexToBitIn32_Char[i]+48);
		//LCD_Char2(s);
	}
	LCD_GoTo(6, 5);
	LCD_String(":::: :::: :::: ::::");
	
	LCD_GoTo(6, 6);
	LCD_String("5432 1098 7654 3210");
	LCD_GoTo(6, 7);
	LCD_String("1111 11 -> ");LCD_String(RegName);
	
	
	
}

void LCD_String(char *string)
{
	while (*string != '\0')
	{
		//if (*string == 208 || *string == 209){string++; }
		//else {
			LCD_Char2(*string);
		string++;
		//}
//рст{|}~#  []^_ :@  !
	}
}

void LCD_Num_To_Str(unsigned int value, unsigned char nDigit)
{
	int rrr = (value / 100) % 10 + 48;
	switch (nDigit)
	{
	case 5: LCD_Char2(value / 10000 + 48);
	case 4: LCD_Char2((value / 1000) % 10 + 48);
	case 3: LCD_Char2((value / 100) % 10 + 48);
	case 2: LCD_Char2((value / 10) % 10 + 48);
	case 1: LCD_Char2(value % 10 + 48);
	}
}

struct Pik Piki[] = {
#if 1 // шрифты идут первыми, чтоб не плодить енамы каждой цифры
	
	2, 10, 0,  // Tahoma2_0
	2, 8, 0,   // Tahoma2_1
	2, 10, 0,  // Tahoma2_2
	2, 10, 0,  // Tahoma2_3
	2, 11, 0,  // Tahoma2_4
	2, 10, 0,  // Tahoma2_5
	2, 10, 0,  // Tahoma2_6
	2, 10, 0,  // Tahoma2_7
	2, 10, 0,  // Tahoma2_8
	2, 10, 0,  // Tahoma2_9
	2, 3, 0,   // Tahoma2_:
	
	
	4,19,0, // Tahoma4_0
	4,14,0, // Tahoma4_1
	4,18,0, // Tahoma4_2
	4,18,0, // Tahoma4_3
	4,20,0, // Tahoma4_4
	4,17,0, // Tahoma4_5
	4,19,0, // Tahoma4_6
	4,18,0, // Tahoma4_7
	4,19,0, // Tahoma4_8
	4,19,0, // Tahoma4_9
	4,5,0,  // Tahoma4_.
 
	6,28,0, // Tahoma4_0
	6,22,0, // Tahoma4_1
	6,27,0, // Tahoma4_2
	6,27,0, // Tahoma4_3
	6,30,0, // Tahoma4_4
	6,26,0, // Tahoma4_5
	6,28,0, // Tahoma4_6
	6,28,0, // Tahoma4_7
	6,28,0, // Tahoma4_8
	6,28,0, // Tahoma4_9
	6,7,0, // Tahoma4_.

	2,14,0, // BatteryKorpus
	1,1,0 // BatteryDelenie
	
	
#endif		
	

	
	


		
};

const uint8_t PikiData[] =
{


#if 1                                                                    // Tahoma2
		#if 1    //       Tahoma2_0    Pages=2 Segments=10
		____XXXX,XXXX____,
		__XXXXXX,XXXXXX__,
		_XXX____,____XXX_,
		XX______,______XX,
		XX______,______XX,
		XX______,______XX,
		XX______,______XX,
		_XXX____,____XXX_,
		__XXXXXX,XXXXXXX_,
		____XXXX,XXXX____,
		#endif
		#if 1    //         Tahoma2_1  Pages=2 Segments=8
		XX______,____XX__,
		XX______,____XX__,
		XX______,____XX__,
		XXXXXXXX,XXXXXXXX,
		XXXXXXXX,XXXXXXXX,
		XX______,________,
		XX______,________,
		XX______,________,
		#endif
		#if 1    //        Tahoma2_2   Pages=2 Segments=10
		XXX_____,_____XX_,
		XXXX____,______XX,
		XXXXX___,______XX,
		XX_XXX__,______XX,
		XX__XXX_,______XX,
		XX___XXX,______XX,
		XX____XX,X____XXX,
		XX______,XXXXXXX_,
		XX______,_XXXXX__,
		XX______,________,
		#endif
		#if 1    //     Tahoma2_3      Pages=2 Segments=10
		_XX_____,_____XX_,
		XX______,_____XXX,
		XX______,______XX,
		XX______,XX____XX,
		XX______,XX____XX,
		XX______,XX____XX,
		XX______,XX____XX,
		_XX____X,XXX__XXX,
		_XXXXXXX,__XXXXX_,
		___XXXX_,___XXX__,
		#endif
		#if 1    //    Tahoma2_4       Pages=2 Segments=11
		______XX,X_______,
		______XX,XX______,
		______XX,_XX_____,
		______XX,__XX____,
		______XX,___XX___,
		______XX,____XX__,
		______XX,_____XX_,
		XXXXXXXX,XXXXXXXX,
		XXXXXXXX,XXXXXXXX,
		______XX,________,
		______XX,________,
		#endif
		#if 1    //   Tahoma2_5        Pages=2 Segments=10
		_XX_____,________,
		XXX_____,XXXXXXXX,
		XX______,XXXXXXXX,
		XX______,XX____XX,
		XX______,XX____XX,
		XX______,XX____XX,
		XX______,XX____XX,
		_XX____X,XX____XX,
		__XXXXXX,X_____XX,
		___XXXXX,______XX,
		#endif
		#if 1    //    Tahoma2_6       Pages=2 Segments=10
		____XXXX,XXX_____,
		__XXXXXX,XXXXX___,
		_XXX___X,X__XXX__,
		XX______,XX___XX_,
		XX______,XX___XXX,
		XX______,XX____XX,
		XX______,XX____XX,
		_XX____X,XX____XX,
		_XXXXXXX,X_____XX,
		___XXXXX,________,
		#endif
		#if 1    //    Tahoma2_7       Pages=2 Segments=10
		________,______XX,
		X_______,______XX,
		XXX_____,______XX,
		_XXXX___,______XX,
		___XXXX_,______XX,
		_____XXX,X_____XX,
		_______X,XXX___XX,
		________,_XXX__XX,
		________,__XXXXXX,
		________,____XXXX,
		#endif
		#if 1    //     Tahoma2_8      Pages=2 Segments=10
		__XXXXX_,__XXXX__,
		_XXXXXXX,_XXXXXX_,
		_XX____X,XXX__XX_,
		XX______,XX____XX,
		XX______,XX____XX,
		XX_____X,X_____XX,
		XX_____X,X_____XX,
		_XX___XX,_X___XXX,
		_XXXXXXX,_XXXXXX_,
		__XXXXX_,__XXXX__,
		#endif
		#if 1    //    Tahoma2_9       Pages=2 Segments=10
		________,XXXXX___,
		XX_____X,XXXXXXX_,
		XX____XX,X____XX_,
		XX____XX,______XX,
		XX____XX,______XX,
		XXX___XX,______XX,
		_XX___XX,______XX,
		__XXX__X,X___XXX_,
		___XXXXX,XXXXXX__,
		_____XXX,XXXXX___,
		#endif

		#if 1    //           Pages=2 Segments=3
		___XXX__,__XXX___,
		___XXX__,__XXX___,
		___XXX__,__XXX___,
		#endif

	
		
#endif  // Tahoma2
	
#if 1                                                                    // Tahoma4
	#if 1    //           Pages=4 Segments=19
	________,_XXXXXXX,XXXXX___,________,
	_____XXX,XXXXXXXX,XXXXXXXX,X_______,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	__XXXXXX,XXXXXXXX,XXXXXXXX,XXXX____,
	_XXXXXXX,________,______XX,XXXXX___,
	_XXXX___,________,________,_XXXX___,
	XXXX____,________,________,__XXXX__,
	XXX_____,________,________,___XXX__,
	XXX_____,________,________,___XXX__,
	XXX_____,________,________,___XXX__,
	XXX_____,________,________,___XXX__,
	XXX_____,________,________,___XXX__,
	XXXX____,________,________,__XXXX__,
	_XXXX___,________,________,_XXXX___,
	_XXXXXXX,________,______XX,XXXXX___,
	__XXXXXX,XXXXXXXX,XXXXXXXX,XXXX____,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	_____XXX,XXXXXXXX,XXXXXXXX,X_______,
	________,_XXXXXXX,XXXXX___,________,
	#endif
	#if 1    //           Pages=4 Segments=14
	XXX_____,________,______XX,X_______,
	XXX_____,________,______XX,X_______,
	XXX_____,________,______XX,X_______,
	XXX_____,________,______XX,X_______,
	XXX_____,________,______XX,XX______,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXX____,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXX_____,________,________,________,
	XXX_____,________,________,________,
	XXX_____,________,________,________,
	XXX_____,________,________,________,
	XXX_____,________,________,________,
	#endif
	#if 1    //           Pages=4 Segments=18
	XXXX____,________,________,________,
	XXXXX___,________,________,XXXX____,
	XXXXXX__,________,________,_XXXX___,
	XXXXXXX_,________,________,__XXX___,
	XXX_XXXX,________,________,__XXX___,
	XXX__XXX,X_______,________,___XXX__,
	XXX___XX,XX______,________,___XXX__,
	XXX____X,XXX_____,________,___XXX__,
	XXX_____,XXXXX___,________,___XXX__,
	XXX_____,_XXXXX__,________,___XXX__,
	XXX_____,__XXXXX_,________,___XXX__,
	XXX_____,___XXXXX,X_______,__XXXX__,
	XXX_____,____XXXX,XXX_____,XXXXX___,
	XXX_____,_____XXX,XXXXXXXX,XXXXX___,
	XXX_____,______XX,XXXXXXXX,XXXX____,
	XXX_____,________,XXXXXXXX,XXX_____,
	XXX_____,________,__XXXXXX,X_______,
	XXX_____,________,________,________,
	#endif
	#if 1    //           Pages=4 Segments=18
	__XXXX__,________,________,________,
	_XXXX___,________,________,XXXX____,
	_XXXX___,________,________,_XXXX___,
	_XXX____,________,________,__XXX___,
	XXXX____,________,________,__XXX___,
	XXX_____,________,________,___XXX__,
	XXX_____,_______X,XX______,___XXX__,
	XXX_____,_______X,XX______,___XXX__,
	XXX_____,_______X,XX______,___XXX__,
	XXX_____,_______X,XX______,___XXX__,
	XXX_____,_______X,XXX_____,___XXX__,
	XXXX____,______XX,XXX_____,__XXXX__,
	_XXXX___,______XX,_XXXX___,_XXXX___,
	_XXXXXX_,____XXXX,_XXXXXXX,XXXXX___,
	__XXXXXX,XXXXXXX_,__XXXXXX,XXXX____,
	___XXXXX,XXXXXXX_,___XXXXX,XXX_____,
	____XXXX,XXXXXX__,____XXXX,XX______,
	______XX,XXXX____,________,________,
	#endif
	#if 1    //           Pages=4 Segments=20
	________,__XXXXX_,________,________,
	________,__XXXXXX,________,________,
	________,__XXXXXX,X_______,________,
	________,__XXX__X,XX______,________,
	________,__XXX___,XXX_____,________,
	________,__XXX___,_XXX____,________,
	________,__XXX___,__XXX___,________,
	________,__XXX___,___XXXX_,________,
	________,__XXX___,____XXXX,________,
	________,__XXX___,_____XXX,X_______,
	________,__XXX___,_______X,XX______,
	________,__XXX___,________,XXX_____,
	________,__XXX___,________,_XXX____,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	________,__XXX___,________,________,
	________,__XXX___,________,________,
	________,__XXX___,________,________,
	#endif
	#if 1    //           Pages=4 Segments=17
	_XXXXX__,________,________,________,
	_XXXX___,______XX,XXXXXXXX,XXXXX___,
	_XXX____,______XX,XXXXXXXX,XXXXX___,
	XXXX____,_______X,XXXXXXXX,XXXXX___,
	XXXX____,_______X,XXXXXXXX,XXXXX___,
	XXX_____,_______X,XX______,__XXX___,
	XXX_____,_______X,XX______,__XXX___,
	XXX_____,_______X,XX______,__XXX___,
	XXX_____,_______X,XX______,__XXX___,
	XXX_____,_______X,XX______,__XXX___,
	XXXX____,______XX,XX______,__XXX___,
	_XXXX___,______XX,XX______,__XXX___,
	_XXXXX__,____XXXX,X_______,__XXX___,
	__XXXXXX,XXXXXXXX,X_______,__XXX___,
	___XXXXX,XXXXXXXX,________,__XXX___,
	____XXXX,XXXXXXX_,________,__XXX___,
	______XX,XXXXX___,________,__XXX___,
	#endif
	#if 1    //           Pages=4 Segments=19
	________,XXXXXXXX,XXX_____,________,
	_____XXX,XXXXXXXX,XXXXXX__,________,
	___XXXXX,XXXXXXXX,XXXXXXXX,________,
	__XXXXXX,XXXXXXXX,XXXXXXXX,XX______,
	__XXXXXX,_______X,X___XXXX,XXX_____,
	_XXXX___,_______X,XX_____X,XXXX____,
	_XXX____,________,XX______,XXXX____,
	XXXX____,________,XXX_____,_XXXX___,
	XXX_____,________,XXX_____,__XXX___,
	XXX_____,________,XXX_____,___XXX__,
	XXX_____,________,XXX_____,___XXX__,
	XXX_____,________,XXX_____,___XXX__,
	XXXX____,_______X,XXX_____,___XXX__,
	_XXXX___,_______X,XXX_____,___XXX__,
	_XXXXX__,_____XXX,XX______,___XXX__,
	__XXXXXX,XXXXXXXX,XX______,__XXXX__,
	___XXXXX,XXXXXXXX,X_______,________,
	____XXXX,XXXXXXXX,________,________,
	_______X,XXXXXX__,________,________,
	#endif
	#if 1    //           Pages=4 Segments=18
	________,________,________,__XXX___,
	________,________,________,__XXX___,
	X_______,________,________,__XXX___,
	XXX_____,________,________,__XXX___,
	XXXXX___,________,________,__XXX___,
	XXXXXXXX,________,________,__XXX___,
	XXXXXXXX,XX______,________,__XXX___,
	___XXXXX,XXXX____,________,__XXX___,
	_____XXX,XXXXXX__,________,__XXX___,
	_______X,XXXXXXXX,________,__XXX___,
	________,_XXXXXXX,XX______,__XXX___,
	________,___XXXXX,XXXX____,__XXX___,
	________,_____XXX,XXXXXXX_,__XXX___,
	________,_______X,XXXXXXXX,X_XXX___,
	________,________,__XXXXXX,XXXXX___,
	________,________,____XXXX,XXXXX___,
	________,________,______XX,XXXXX___,
	________,________,________,XXXXX___,
	#endif
	#if 1    //           Pages=4 Segments=19
	______XX,XXX_____,________,________,
	____XXXX,XXXXX___,____XXXX,X_______,
	__XXXXXX,XXXXXX__,__XXXXXX,XXX_____,
	__XXXXXX,XXXXXXX_,_XXXXXXX,XXXX____,
	_XXXXX__,____XXXX,XXXXXXXX,XXXXX___,
	_XXXX___,_____XXX,XXXXX___,_XXXX___,
	XXXX____,______XX,XXXX____,__XXXX__,
	XXX_____,_______X,XXX_____,___XXX__,
	XXX_____,_______X,XX______,___XXX__,
	XXX_____,______XX,XX______,___XXX__,
	XXX_____,______XX,X_______,___XXX__,
	XXX_____,_____XXX,X_______,___XXX__,
	XXXX____,_____XXX,XX______,__XXXX__,
	_XXX____,____XXXX,XXX_____,_XXXX___,
	_XXXXX__,___XXXXX,XXXXXXXX,XXXXX___,
	__XXXXXX,XXXXXXX_,_XXXXXXX,XXXX____,
	___XXXXX,XXXXXX__,__XXXXXX,XXX_____,
	____XXXX,XXXXX___,____XXXX,X_______,
	______XX,XXXX____,________,________,
	#endif
	#if 1    //           Pages=4 Segments=19
	________,________,_XXXXXX_,________,
	________,______XX,XXXXXXXX,XX______,
	________,_____XXX,XXXXXXXX,XXX_____,
	XXXX____,____XXXX,XXXXXXXX,XXXX____,
	XXX_____,____XXXX,X_______,XXXXX___,
	XXX_____,___XXXX_,________,_XXXX___,
	XXX_____,___XXXX_,________,__XXXX__,
	XXX_____,___XXX__,________,___XXX__,
	XXX_____,___XXX__,________,___XXX__,
	XXX_____,___XXX__,________,___XXX__,
	_XXX____,___XXX__,________,___XXX__,
	_XXXX___,___XXX__,________,___XXX__,
	__XXXX__,____XX__,________,__XXXX__,
	__XXXXX_,____XXX_,________,_XXXX___,
	___XXXXX,XX___XX_,______XX,XXXXX___,
	____XXXX,XXXXXXXX,XXXXXXXX,XXXX____,
	______XX,XXXXXXXX,XXXXXXXX,XXX_____,
	________,XXXXXXXX,XXXXXXXX,X_______,
	________,___XXXXX,XXXXXX__,________,
	#endif
	#if 1    //           Pages=4 Segments=5
	XXXXX___,________,________,________,
	XXXXX___,________,________,________,
	XXXXX___,________,________,________,
	XXXXX___,________,________,________,
	XXXXX___,________,________,________,
	#endif

#endif	// Tahoma4                              
#if 1                                                                    // Tahoma6	
	#if 1    //           Pages=6 Segments=28
	________,_______X,XXXXXXXX,XXXXXXX_,________,________,
	________,__XXXXXX,XXXXXXXX,XXXXXXXX,XXXX____,________,
	_______X,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXX_,________,
	_____XXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,X_______,
	____XXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XX______,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	__XXXXXX,XXXXXX__,________,________,XXXXXXXX,XXXX____,
	__XXXXXX,XX______,________,________,____XXXX,XXXX____,
	_XXXXXXX,________,________,________,______XX,XXXXX___,
	_XXXXXX_,________,________,________,_______X,XXXXX___,
	XXXXXX__,________,________,________,________,XXXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXX___,________,________,________,________,_XXXXX__,
	XXXXXX__,________,________,________,________,XXXXXX__,
	_XXXXXX_,________,________,________,_______X,XXXXX___,
	_XXXXXXX,________,________,________,______XX,XXXXX___,
	__XXXXXX,XX______,________,________,____XXXX,XXXX____,
	__XXXXXX,XXXXXX__,________,________,XXXXXXXX,XXXX____,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	____XXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XX______,
	_____XXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,________,
	_______X,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXX_,________,
	________,__XXXXXX,XXXXXXXX,XXXXXXXX,XXXX____,________,
	________,_______X,XXXXXXXX,XXXXXXX_,________,________,
	#endif
	#if 1    //           Pages=6 Segments=22
	_XXXX___,________,________,________,___XXXX_,________,
	_XXXX___,________,________,________,___XXXX_,________,
	_XXXX___,________,________,________,___XXXX_,________,
	_XXXX___,________,________,________,___XXXX_,________,
	_XXXX___,________,________,________,___XXXX_,________,
	_XXXX___,________,________,________,___XXXXX,________,
	_XXXX___,________,________,________,___XXXXX,________,
	_XXXX___,________,________,________,___XXXXX,X_______,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XX______,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	_XXXX___,________,________,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=27
	_XXXXXXX,________,________,________,________,________,
	_XXXXXXX,X_______,________,________,_____XXX,XXXX____,
	_XXXXXXX,XX______,________,________,______XX,XXXX____,
	_XXXXXXX,XXX_____,________,________,_______X,XXXX____,
	_XXXXXXX,XXXX____,________,________,_______X,XXXXX___,
	_XXXXXXX,XXXXX___,________,________,________,XXXXX___,
	_XXXXX_X,XXXXXX__,________,________,________,XXXXX___,
	_XXXXX__,XXXXXXX_,________,________,________,XXXXX___,
	_XXXXX__,_XXXXXXX,________,________,________,_XXXXX__,
	_XXXXX__,__XXXXXX,X_______,________,________,_XXXXX__,
	_XXXXX__,___XXXXX,XX______,________,________,_XXXXX__,
	_XXXXX__,____XXXX,XXX_____,________,________,_XXXXX__,
	_XXXXX__,_____XXX,XXXX____,________,________,_XXXXX__,
	_XXXXX__,______XX,XXXXX___,________,________,_XXXXX__,
	_XXXXX__,_______X,XXXXXXX_,________,________,_XXXXX__,
	_XXXXX__,________,XXXXXXXX,________,________,XXXXXX__,
	_XXXXX__,________,_XXXXXXX,XX______,________,XXXXX___,
	_XXXXX__,________,__XXXXXX,XXX_____,_______X,XXXXX___,
	_XXXXX__,________,___XXXXX,XXXXXX__,_____XXX,XXXXX___,
	_XXXXX__,________,____XXXX,XXXXXXXX,XXXXXXXX,XXXX____,
	_XXXXX__,________,______XX,XXXXXXXX,XXXXXXXX,XXXX____,
	_XXXXX__,________,_______X,XXXXXXXX,XXXXXXXX,XXX_____,
	_XXXXX__,________,________,_XXXXXXX,XXXXXXXX,XX______,
	_XXXXX__,________,________,__XXXXXX,XXXXXXXX,________,
	_XXXXX__,________,________,_____XXX,XXXXXX__,________,
	_XXXXX__,________,________,________,________,________,
	_XXXXX__,________,________,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=27
	__XXXXXX,X_______,________,________,________,________,
	__XXXXXX,________,________,________,_____XXX,XXXX____,
	__XXXXXX,________,________,________,______XX,XXXX____,
	_XXXXXX_,________,________,________,______XX,XXXX____,
	_XXXXXX_,________,________,________,_______X,XXXXX___,
	_XXXXX__,________,________,________,_______X,XXXXX___,
	_XXXXX__,________,________,________,________,XXXXX___,
	XXXXXX__,________,________,________,________,XXXXX___,
	XXXXX___,________,________,________,________,XXXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXX___,________,______XX,XXX_____,________,_XXXXX__,
	XXXXXX__,________,______XX,XXXX____,________,_XXXXX__,
	XXXXXX__,________,_____XXX,XXXX____,________,XXXXXX__,
	_XXXXXX_,________,_____XXX,XXXXX___,________,XXXXXX__,
	_XXXXXX_,________,____XXXX,XXXXXX__,_______X,XXXXX___,
	__XXXXXX,X_______,___XXXXX,__XXXXXX,_____XXX,XXXXX___,
	__XXXXXX,XXX_____,__XXXXXX,__XXXXXX,XXXXXXXX,XXXX____,
	___XXXXX,XXXXXXXX,XXXXXXXX,___XXXXX,XXXXXXXX,XXXX____,
	____XXXX,XXXXXXXX,XXXXXXX_,____XXXX,XXXXXXXX,XXX_____,
	_____XXX,XXXXXXXX,XXXXXX__,_____XXX,XXXXXXXX,XX______,
	______XX,XXXXXXXX,XXXXX___,______XX,XXXXXXXX,X_______,
	_______X,XXXXXXXX,XXXX____,________,XXXXXXX_,________,
	________,__XXXXXX,XX______,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=30
	________,________,XXXXXXX_,________,________,________,
	________,________,XXXXXXXX,________,________,________,
	________,________,XXXXXXXX,X_______,________,________,
	________,________,XXXXXXXX,XXX_____,________,________,
	________,________,XXXXX_XX,XXXX____,________,________,
	________,________,XXXXX__X,XXXXX___,________,________,
	________,________,XXXXX___,XXXXXX__,________,________,
	________,________,XXXXX___,_XXXXXX_,________,________,
	________,________,XXXXX___,___XXXXX,________,________,
	________,________,XXXXX___,____XXXX,XX______,________,
	________,________,XXXXX___,_____XXX,XXX_____,________,
	________,________,XXXXX___,______XX,XXXX____,________,
	________,________,XXXXX___,_______X,XXXXX___,________,
	________,________,XXXXX___,________,_XXXXX__,________,
	________,________,XXXXX___,________,__XXXXX_,________,
	________,________,XXXXX___,________,___XXXXX,X_______,
	________,________,XXXXX___,________,____XXXX,XX______,
	________,________,XXXXX___,________,_____XXX,XXX_____,
	________,________,XXXXX___,________,______XX,XXXX____,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,
	________,________,XXXXX___,________,________,________,
	________,________,XXXXX___,________,________,________,
	________,________,XXXXX___,________,________,________,
	________,________,XXXXX___,________,________,________,
	________,________,XXXXX___,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=26
	__XXXXXX,X_______,________,________,________,________,
	__XXXXXX,________,________,________,________,________,
	__XXXXXX,________,______XX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXX_,________,______XX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXXX_,________,______XX,XXXXXXXX,XXXXXXXX,XXXXX___,
	_XXXXX__,________,_______X,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXX__,________,_______X,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXXX__,________,_______X,XXXXXXXX,XXXXXXXX,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXX___,________,_______X,XXXX____,________,XXXXX___,
	XXXXXX__,________,______XX,XXXX____,________,XXXXX___,
	_XXXXX__,________,______XX,XXXX____,________,XXXXX___,
	_XXXXXX_,________,_____XXX,XXX_____,________,XXXXX___,
	__XXXXXX,X_______,____XXXX,XXX_____,________,XXXXX___,
	__XXXXXX,XXX_____,__XXXXXX,XXX_____,________,XXXXX___,
	___XXXXX,XXXXXXXX,XXXXXXXX,XX______,________,XXXXX___,
	____XXXX,XXXXXXXX,XXXXXXXX,X_______,________,XXXXX___,
	_____XXX,XXXXXXXX,XXXXXXXX,X_______,________,XXXXX___,
	______XX,XXXXXXXX,XXXXXXX_,________,________,XXXXX___,
	________,XXXXXXXX,XXXXXX__,________,________,XXXXX___,
	________,___XXXXX,XXX_____,________,________,XXXXX___,
	#endif
	#if 1    //           Pages=6 Segments=28
	________,______XX,XXXXXXXX,XXX_____,________,________,
	________,__XXXXXX,XXXXXXXX,XXXXXXXX,________,________,
	_______X,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXX_____,________,
	______XX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXX___,________,
	____XXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXX_,________,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,________,
	__XXXXXX,XXXXX___,______XX,XX___XXX,XXXXXXXX,X_______,
	__XXXXXX,XX______,______XX,XXX_____,_XXXXXXX,XX______,
	_XXXXXXX,________,_______X,XXX_____,___XXXXX,XXX_____,
	_XXXXXX_,________,_______X,XXXX____,_____XXX,XXX_____,
	XXXXXX__,________,________,XXXX____,______XX,XXXX____,
	XXXXXX__,________,________,XXXXX___,_______X,XXXXX___,
	XXXXX___,________,________,XXXXX___,_______X,XXXXX___,
	XXXXX___,________,________,XXXXX___,________,XXXXX___,
	XXXXX___,________,________,XXXXX___,________,XXXXX___,
	XXXXX___,________,________,XXXXX___,________,_XXXXX__,
	XXXXX___,________,________,XXXXX___,________,_XXXXX__,
	XXXXXX__,________,_______X,XXXXX___,________,_XXXXX__,
	_XXXXX__,________,_______X,XXXXX___,________,_XXXXX__,
	_XXXXXX_,________,______XX,XXXX____,________,_XXXXX__,
	_XXXXXXX,________,_____XXX,XXXX____,________,_XXXXX__,
	__XXXXXX,XXX_____,___XXXXX,XXXX____,________,_XXXXX__,
	___XXXXX,XXXXXXXX,XXXXXXXX,XXX_____,________,XXXXXX__,
	____XXXX,XXXXXXXX,XXXXXXXX,XX______,________,XXXXXX__,
	_____XXX,XXXXXXXX,XXXXXXXX,X_______,________,________,
	______XX,XXXXXXXX,XXXXXXXX,________,________,________,
	________,XXXXXXXX,XXXXXXX_,________,________,________,
	________,___XXXXX,XXXX____,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=28
	________,________,________,________,________,XXXXX___,
	________,________,________,________,________,XXXXX___,
	________,________,________,________,________,XXXXX___,
	_X______,________,________,________,________,XXXXX___,
	_XXX____,________,________,________,________,XXXXX___,
	_XXXXX__,________,________,________,________,XXXXX___,
	_XXXXXXX,________,________,________,________,XXXXX___,
	_XXXXXXX,XX______,________,________,________,XXXXX___,
	_XXXXXXX,XXXX____,________,________,________,XXXXX___,
	_XXXXXXX,XXXXXX__,________,________,________,XXXXX___,
	___XXXXX,XXXXXXXX,________,________,________,XXXXX___,
	_____XXX,XXXXXXXX,XX______,________,________,XXXXX___,
	_______X,XXXXXXXX,XXXX____,________,________,XXXXX___,
	________,_XXXXXXX,XXXXXX__,________,________,XXXXX___,
	________,___XXXXX,XXXXXXXX,________,________,XXXXX___,
	________,_____XXX,XXXXXXXX,XXX_____,________,XXXXX___,
	________,_______X,XXXXXXXX,XXXXX___,________,XXXXX___,
	________,________,_XXXXXXX,XXXXXXX_,________,XXXXX___,
	________,________,___XXXXX,XXXXXXXX,X_______,XXXXX___,
	________,________,_____XXX,XXXXXXXX,XXX_____,XXXXX___,
	________,________,_______X,XXXXXXXX,XXXXX___,XXXXX___,
	________,________,________,_XXXXXXX,XXXXXXX_,XXXXX___,
	________,________,________,___XXXXX,XXXXXXXX,XXXXX___,
	________,________,________,_____XXX,XXXXXXXX,XXXXX___,
	________,________,________,_______X,XXXXXXXX,XXXXX___,
	________,________,________,________,_XXXXXXX,XXXXX___,
	________,________,________,________,____XXXX,XXXXX___,
	________,________,________,________,______XX,XXXXX___,
	#endif
	#if 1    //           Pages=6 Segments=28
	________,_XXXXXXX,X_______,________,________,________,
	_______X,XXXXXXXX,XXX_____,_______X,XXXXXX__,________,
	_____XXX,XXXXXXXX,XXXXX___,_____XXX,XXXXXXXX,________,
	____XXXX,XXXXXXXX,XXXXXX__,____XXXX,XXXXXXXX,X_______,
	___XXXXX,XXXXXXXX,XXXXXXX_,___XXXXX,XXXXXXXX,XXX_____,
	__XXXXXX,XXXXXXXX,XXXXXXX_,__XXXXXX,XXXXXXXX,XXX_____,
	__XXXXXX,XX______,_XXXXXXX,_XXXXXXX,XXXXXXXX,XXXX____,
	_XXXXXXX,________,___XXXXX,XXXXXXXX,______XX,XXXXX___,
	_XXXXX__,________,_____XXX,XXXXXXX_,________,XXXXX___,
	_XXXXX__,________,______XX,XXXXXX__,________,_XXXX___,
	XXXXX___,________,_______X,XXXXX___,________,_XXXXX__,
	XXXX____,________,_______X,XXXX____,________,__XXXX__,
	XXXX____,________,______XX,XXXX____,________,__XXXX__,
	XXXX____,________,______XX,XXX_____,________,__XXXX__,
	XXXX____,________,_____XXX,XXX_____,________,__XXXX__,
	XXXX____,________,_____XXX,XXX_____,________,__XXXX__,
	XXXX____,________,_____XXX,XX______,________,__XXXX__,
	XXXXX___,________,____XXXX,XX______,________,_XXXXX__,
	_XXXX___,________,___XXXXX,XXX_____,________,_XXXX___,
	_XXXXX__,________,___XXXXX,XXXXX___,________,XXXXX___,
	_XXXXXX_,________,__XXXXXX,XXXXXXX_,______XX,XXXXX___,
	__XXXXXX,X_______,XXXXXXXX,_XXXXXXX,XXXXXXXX,XXXX____,
	___XXXXX,XXXXXXXX,XXXXXXX_,__XXXXXX,XXXXXXXX,XXXX____,
	___XXXXX,XXXXXXXX,XXXXXX__,___XXXXX,XXXXXXXX,XXX_____,
	____XXXX,XXXXXXXX,XXXXXX__,____XXXX,XXXXXXXX,XX______,
	_____XXX,XXXXXXXX,XXXXX___,_____XXX,XXXXXXXX,________,
	_______X,XXXXXXXX,XXX_____,________,XXXXXX__,________,
	________,__XXXXXX,X_______,________,________,________,
	#endif
	#if 1    //           Pages=6 Segments=28
	________,________,________,__XXXXXX,XXX_____,________,
	________,________,_______X,XXXXXXXX,XXXXXX__,________,
	________,________,______XX,XXXXXXXX,XXXXXXXX,________,
	________,________,_____XXX,XXXXXXXX,XXXXXXXX,X_______,
	XXXXXX__,________,____XXXX,XXXXXXXX,XXXXXXXX,XX______,
	XXXXXX__,________,___XXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	XXXXX___,________,__XXXXXX,XXX_____,___XXXXX,XXXX____,
	XXXXX___,________,__XXXXXX,X_______,______XX,XXXX____,
	XXXXX___,________,__XXXXXX,________,_______X,XXXXX___,
	XXXXX___,________,_XXXXXX_,________,________,XXXXX___,
	XXXXX___,________,_XXXXXX_,________,________,XXXXXX__,
	XXXXX___,________,_XXXXX__,________,________,_XXXXX__,
	XXXXX___,________,_XXXXX__,________,________,_XXXXX__,
	XXXXXX__,________,_XXXXX__,________,________,_XXXXX__,
	_XXXXX__,________,_XXXXX__,________,________,_XXXXX__,
	_XXXXX__,________,_XXXXX__,________,________,_XXXXX__,
	_XXXXXX_,________,_XXXXX__,________,________,XXXXXX__,
	__XXXXXX,________,__XXXX__,________,________,XXXXXX__,
	__XXXXXX,X_______,__XXXXX_,________,_______X,XXXXX___,
	___XXXXX,XXX_____,___XXXX_,________,______XX,XXXXX___,
	____XXXX,XXXXX___,___XXXXX,________,____XXXX,XXXX____,
	_____XXX,XXXXXXXX,X___XXXX,________,_XXXXXXX,XXXX____,
	______XX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXX_____,
	_______X,XXXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,XX______,
	________,_XXXXXXX,XXXXXXXX,XXXXXXXX,XXXXXXXX,________,
	________,___XXXXX,XXXXXXXX,XXXXXXXX,XXXXXXX_,________,
	________,______XX,XXXXXXXX,XXXXXXXX,XXXX____,________,
	________,________,___XXXXX,XXXXXXXX,________,________,
	#endif
	#if 1    //           Pages=6 Segments=7
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	XXXXXX__,________,________,________,________,________,
	#endif
	
	
	
#endif  // Tahoma6	
	
#if 1    //     BatteryKorpus      Pages=2 Segments=14
______XX,XXXXX___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______X_,____X___,
______XX,XXXXX___,
________,XXX_____,
________,XXX_____,
#endif
#if 1    //      BatteryDelenie      Pages=1 Segments=1
XXX_X___,
#endif

};

//void LCD_DispClock()

void LCD_PrintPik(uint8_t Page, uint8_t Segment, enum enPikiNames Pik, enum LCD_PrintType PT ) {
	//uint8_t KOL=Piki
	int curS = Segment;
	
	for (uint8_t P = 0; P < Piki[Pik].Pages && P + Page <= 7; P++) {
		LCD_GoTo(Segment, Page + P);
		for (uint16_t S = Piki[Pik].Pages - P-1; S < Piki[Pik].Segments*Piki[Pik].Pages; S += Piki[Pik].Pages) {
			curS++;
			switch (PT)
			{
			case LCDpt_NOINV: sendData(PikiData[S + Piki[Pik].FirstByte]); break;
			case LCDpt_INV: sendData(~PikiData[S + Piki[Pik].FirstByte]); break;
			case LCDpt_DEL: sendData(0); break;
			default:
				break;
			}
			
			
			//if (Inverse != 1) sendData(PikiData[S + Piki[Pik].FirstByte]); 
			//else sendData(~PikiData[S + Piki[Pik].FirstByte]); 
			
		}
	}
}



void LCD_init(void)
{
	
	for (uint8_t i = 1; i <  sizeof(Piki) / sizeof(*Piki); i++) {
		Piki[i].FirstByte = Piki[i - 1].Pages *Piki[i - 1].Segments + Piki[i-1].FirstByte;
	}
	
	// Turn display off
	sendCommand(OLED_DISPLAYOFF);

	
	
	//sendCommand(0xC0);

	
	sendCommand(OLED_SETDISPLAYCLOCKDIV);
	sendCommand(0x80);

	sendCommand(OLED_SETMULTIPLEX);
	//sendCommand(0x1F);//128x32
	sendCommand(0x3F);  //128x64

	sendCommand(OLED_SETDISPLAYOFFSET);
	sendCommand(0x02);

	sendCommand(OLED_SETSTARTLINE | 0x00);  //0

	// We use internal charge pump
	sendCommand(OLED_CHARGEPUMP);
	sendCommand(0x14);
//
//	
	sendCommand(OLED_MEMORYMODE);// Horizontal addressing mode (A[1:0]=00b) Page addressing mode (A[1:0]=10xb) Vertical addressing mode: (A[1:0]=01b)
	sendCommand(0x00);
//	//int iii = 0b00000010;
//	
//	//sendCommand(0b00000000);
	
//	
	sendCommand(0x21);
	sendCommand(0x10);
	sendCommand(0x7E);
	
	sendCommand(0x22);
	sendCommand(0x0);
	sendCommand(0x7);
	
	
	sendCommand(OLED_SEGREMAP | 0x1);

	sendCommand(OLED_COMSCANDEC);

	sendCommand(OLED_SETCOMPINS);
	//sendCommand(0x02);//128x32
	
	sendCommand(0x12);   //128x64

	// Max contrast
	sendCommand(OLED_SETCONTRAST);
	//sendCommand(0x0F);//0xCF
	sendCommand(0xCF);   //0xCF

	sendCommand(OLED_SETPRECHARGE);
	sendCommand(0xF1);

	sendCommand(OLED_SETVCOMDETECT);
	//sendCommand(0x10);//0x40
	sendCommand(0x40);  //0x40

	sendCommand(OLED_DISPLAYALLON_RESUME);

	// Non-inverted display
	sendCommand(OLED_NORMALDISPLAY);

	// Turn display back on
	sendCommand(OLED_DISPLAYON);
}



